url_list=[
    'http://hls.videocc.net/b034527feb/c/b034527febaadd9eec665473f65c768c_3.m3u8?pid=1676549433984X1449635&device=desktop',
    'http://hls.videocc.net/b034527feb/5/b034527febccf4e55e2565191e38ca55_3.m3u8?pid=1676553596327X1042482&device=desktop',
    'http://hls.videocc.net/b034527feb/1/b034527feb317186e6936968486c7d61_3.m3u8?pid=1676553743792X1217589&device=desktop'
]#在这里天上你要下载的m3u8文件的URL
token_list=[
    '?token=14342c18-c8f5-4d7f-b667-ca4dba4dcf95-i0',
    '?token=1b65872a-5a6f-4a06-9cb4-5bc7b371a80e-g0',
    '?token=39ae247e-681e-498f-b2a5-68213cc18352-o0'
]
path_list=[
    '政治/第一部分/第一章  马克思主义哲学原理、马克思主义哲学是科学的世界观和方法论/考点一、二、三 哲学与世界观、方法论、哲学的基本问题、哲学的主要派别/',
    '政治/第一部分/第一章  马克思主义哲学原理、马克思主义哲学是科学的世界观和方法论/考点一、二、三 哲学与世界观、方法论、哲学的基本问题、哲学的主要派别/',
    '政治/第一部分/第一章  马克思主义哲学原理、马克思主义哲学是科学的世界观和方法论/考点一、二、三 哲学与世界观、方法论、哲学的基本问题、哲学的主要派别/'
]
title_list=[
    '视频1 哲学与世界观、方法论',
    '视频2 哲学的基本问题',
    '视频3 哲学的主要派别'
]